export default {
    dictionary: [
        "う",
        "く",
        "ぐ",
        "す",
        "つ",
        "ぬ",
        "ぶ",
        "む",
        "る",
        "する",
        "くる"
    ],

    te: [
        "って",
        "んで",
        "いて",
        "いで",
        "して",
        "て"
    ],

    ta: [
        "った",
        "んだ",
        "いた",
        "いだ",
        "した",
        "た"
    ],

    nai: [
        "わない",
        "かない",
        "がない",
        "さない",
        "たない",
        "なない",
        "ばない",
        "まない",
        "らない",
        "ない",
        "しない",
        "こない"
    ],

    tara: [
        "ったら",
        "んだら",
        "いたら",
        "いだら",
        "したら",
        "たら"
    ],

    tari: [
        "ったり",
        "んだり",
        "いたり",
        "いだり",
        "したり",
        "たり",
        "きたり"
    ]

};