// =========================================
// ことばさがし（開発用）
// =========================================

// -----------------------------------------
// 5×5盤面の仮データ
// -----------------------------------------

const boardData = [

    "あ", "さ", "い", "ぬ", "ね", "さ", "い", "ぬ", "ね",
    "こ", "み", "か", "た", "ち", "み", "か", "た", "ち",
    "や", "ゆ", "よ", "る", "ん", "ゆ", "よ", "る", "ん",
    "え", "お", "は", "ひ", "ふ", "お", "は", "ひ", "ふ",
    "あ", "さ", "い", "ぬ", "ね", "さ", "い", "ぬ", "ね",
    "こ", "み", "か", "た", "ち", "み", "か", "た", "ち",
    "や", "ゆ", "よ", "る", "ん", "ゆ", "よ", "る", "ん",
    "え", "お", "は", "ひ", "ふ", "お", "は", "ひ", "ふ",
    "へ", "ほ", "ま", "み", "む", "ほ", "ま", "み", "む"

];

// -----------------------------------------
// 盤面作成
// -----------------------------------------
const BOARD_SIZE = 8;

// boardを取得
const board = document.getElementById("board");

// 列数を設定
board.style.gridTemplateColumns =
    `repeat(${BOARD_SIZE}, 1fr)`;

// マスを作成
boardData.forEach(letter => {

    const cell = document.createElement("div");

    cell.className = "cell";

    cell.textContent = letter;

    board.appendChild(cell);

});